[
{
    "APT1": {
        "type": "threat actor",
        "description":"APT1 is a single organization of operators that has conducted a cyber espionage campaign against a broad range of victims since at least 2006. From our observations, it is one of the most prolific cyber espionage groups in terms of the sheer quantity of information stolen.",
        "years":"2006-2013",
        "sources":[    
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2013/2013.02.18.APT1/Mandiant_APT1_Report.pdf"
        ]
    },
    "TeamSpy": {
        "type": "threat actor",
        "description":"For at least several years, a mysterious threat actor infiltrated and tracked, performed surveillance and stole data from governmental organisations, some private companies and human rights activists throughout the Commonwealth of Independent States (CIS) and Eastern European nations. Some parts of this operation extended into Western nations and the Middle East as well, with victims in sectors such as energy and heavy industry manufacturing.",
        "years":"2008-2013",
        "sources":[    
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2013/2013.03.20.TeamSpy_Crew/theteamspystory_final_t2.pdf"
        ]
    },
    "Gh0st Rat": {
        "type": "malware",
        "description": "",
        "years": "2009-2012",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2012/2012.04.10.Gh0st_RAT/Know%20Your%20Digital%20Enemy.pdf"
        ]
    },
    "RedOctober": {
        "type": "malware",
        "description": "",
        "years": "2012-2013",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/tree/master/2013/2013.01.14.Red_October_Campaign"
        ]
    },
    "icefog": {
        "type": "threat actor",
        "description": "The Icefog targeted attacks rely on spear-phishing e-mails that attempt to trick the victim into opening a malicious attachment or a website.",
        "years": "2013",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2013/icefog.pdf"
        ]
    },
    "Nettraveler":
    {
        "type": "malware",
        "description": "nettraveler is an automatic data exfiltration tool, designed to extract large amounts of private information from the victim’s system over long periods of time. the malware uses compression techniques and a fail-safe protocol to ensure that uploaded data is safely transferred to the attacker’s c2s.",
        "years": "2004-2013",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2013/kaspersky-the-net-traveler-part1-final.pdf"
        ]
    },
    "ETSO": {
        "type": "threat actor",
        "description": "In the APT attacks against the companies in Korea, the ETSO Attack Group used encrypted communication between the master which generated the malware, monitored the system and managed the C2 agent, and the agent which accessed the C2 server. The ETSO Attack Group penetrated the targeted network via the C2 agent and remained dormant for a long period of time without any abnormal behavior that would trigger a network error or website compromise, thus making it difficult to detect the attacks.",
        "years": "2011-2013",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2013/ETSO_APT_Attacks_Analysis.pdf"
        ]
    },
    "Trojan.APT.Seinup": {
        "type": "malware",
        "description": "The FireEye research team has recently identified a number of spear phishing activities targeting Asia and ASEAN. Of these, one of the spear phishing documents was suspected to have used a potentially stolen document as a decoy. The rich and contextual details (body and metadata) which are not available online lead us to believe this was stolen. This decoy document mentioned countries such as Brunei, Cambodia, Indonesia, Laos, Malaysia, Myanmar, Philippines, Singapore, Thailand, and Vietnam, which leads us to suspect that these countries are targeted. As the content of this decoy document is suspected to be a stolen sensitive document, the details will not be published.",
        "years": "2012-2013",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2013/Trojan.APT.Seinup.pdf"
        ]
    },
    "Wild Neutron": {
        "type": "threat actor",
        "description": "A powerful threat actor known as “Wild Neutron” (also known as “Jripbot” and “Morpho“) has been active since at least 2011, infecting high profile companies for several years by using a combination of exploits, watering holes and multi-platform malware.",
        "years": "2013-2015",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2015/2015.07.08.Wild_Neutron/WildNeutron_Economic_espionage.pdf"
        ]
    },
    "Duqu Trojan": {
        "type": "malware",
        "description": "Duqu's primary purpose is to provide an attacker with remote access to a com- promised computer, including the ability to run arbitrary programs. It can theoretically be used to target any organization",
        "years": "2010",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2011/2011.10.26.Duqu/Duqu_Trojan_Questions_and_Answers.pdf"
        ]
    },
    "Turbo": {
        "type": "malware",
        "description": "This malware has been reported to have been used in high profile incidents like the ones involving Wellpoint/Anthem, USIS and Mitsubishi Heavy Industries. These incidents have ranged from simple targeting to reported breaches. Every one of these campaigns involved a Windows version of Derusbi.",
        "years": "2015",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2016/2016.02.29.Turbo_Campaign_Derusbi/TA_Fidelis_Turbo_1602_0.pdf"
        ]
    },
    "Jaku": {
        "type": "malware",
        "description": "JAKU demonstrates is the re-use of Infrastructure, Tools, Techniques and Processes (TTPs), as well as the herding of victims into separate groupings; some indiscriminate and others highly targeted. Both the herding of general botnet victims and highly targeted attacks on individuals and organisations is hardly surprising. What is somewhat of a step change, however, is the execution of a number of concurrent operations within a campaign, using almost identical TTPs, to both herd thousands of victims into becoming botnet members while at the same time executing a targeted operation on a very small number of individuals.",
        "years": "2015-2016",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2016/2016.05.05_Jaku_botnet_campaign/report_jaku_analysis_of_botnet_campaign_en_0.pdf"
        ]
    },
    "Operation Hangover": {
        "type": "malware",
        "description": "The purpose of this malware seems predominantly to be a platform for surveillance against targets of national security interest (such as Pakistan), but we will also show how it has been used for industrial espionage against the Norwegian telecom corporation Telenor and other civilian corporations.",
        "years": "2015-2016",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2013/2013.05.20.Operation_Hangover/NS-Unveiling-an-Indian-Cyberattack-Infrastructure_FINAL_Web.pdf"
        ]
    },
    "SIDEWINDER": {
        "type": "malware",
        "description": "Android apps and the Android system itself contain vulnerabilities. Aggressive ad libraries also leak the user’s private information. By leveraging all these vulnerabilities, an attacker can conduct more targeted attacks, which we call “Sidewinder Targeted Attacks.”",
        "years": "2014",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2014/fireeye-sidewinder-targeted-attack.pdf"
        ]
    },
    "DarkComet": {
        "type": "malware",
        "description": "DarkComet is primarily a general purpose remote access trojan (RAT)",
        "years": "2012",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2012/2012.03.13.DarkComet_RAT/Crypto-DarkComet-Report.pdf"
        ]
    },
    "Operation Cleaver": {
        "type": "threat actor",
        "description": "The focus of the Operation Cleaver report is on one particular Iranian team we’ve dubbed Tarh Andishan, the infrastructure they utilize, as well as their tactics, techniques and procedures. Roughly translated, 'Tarh Andishan' means 'thinkers' or 'innovators'. This team displays an evolved skillset and uses a complex infrastructure to perform attacks of espionage, theft, and the potential destruction of control systems and networks. While our investigation is ongoing, and we presently have limited visibility inside many of the compromised networks, Cylance observed Tarh Andishan actively targeting, attacking, and compromising more than 50 victims since at least 2012.",
        "years": "2012-2013",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2014/2014.12.02.Operation_Cleaver/Cylance_Operation_Cleaver_Report.pdf"
        ]
    },
    "Operation Dust Storm": {
        "type": "threat actor",
        "description": "Our research indicates Operation Dust Storm has been operational since at least early 2010, and has employed a number of different operational techniques, including spear phishing, waterholes, and zero-day exploits over time. Several antivirus companies initially detected early backdoor samples under the moniker Misdat, but the group has quietly evolved over the years to remain undetected and highly effective.",
        "years": "2010-2015",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2016/2016.02.23.Operation_Dust_Storm/Op_Dust_Storm_Report.pdfhttps://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2016/2016.02.23.Operation_Dust_Storm/Op_Dust_Storm_Report.pdf"
        ]
    },
    "ZooPark": {
        "type": "threat actor",
        "description": "ZooPark is a cyberespionage operation that has been focusing on Middle Eastern targets since at least June 2015. The threat actors behind ZooPark infect Android devices using several generations of malware we label from v1-v4, with v4 being the most recent version deployed in 2017.",
        "years": "2015-2017",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2018/2018.05.03.whos-who-in-the-zoo/ZooPark_for_public_final_edit.pdf"
        ]
    },
    "Epic Turla": {
        "type": "threat actor",
        "description": "The attackers behind Epic Turla have infected several hundred computers in more than 45 countries, including government institutions, embassies, military, education, research and pharmaceutical companies.",
        "years": "< Known years active >",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2014/The_Epic_Turla_Operation.pdf",
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2014/KL_Epic_Turla_Technical_Appendix_20140806.pdf"
        ]
    },
    "Energetic Bear": {
        "type": "threat actor",
        "description": "Energetic Bear/Crouching Yeti is an actor involved in several advanced persistent threat (APT) campaigns that have been active going back to at least the end of 2010. Targeted sectors include: Industrial/machinery, Manufacturing, Pharmaceutical, Construction, Education, and Information technology",
        "years": "2010-2014",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2014/EB-YetiJuly2014-Public.pdf"
        ]
    },
    "APT37": {
        "type": "threat actor",
        "description": "A suspected North Korean cyber espionage group that we now track as APT37 (Reaper). Recent examination of this group’s activities by FireEye iSIGHT Intelligence reveals APT37 has expanded its operations in both scope and sophistication. APT37’s toolset, which includes access to zero-day vulnerabilities and wiper malware, combined with heightened tensions in Northeast Asia and North Korea’s penchant for norm breaking, means this group should be taken seriously.",
        "years": "2014-2017",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2018/2018.02.20.APT37/rpt_APT37.pdf"
        ]
    },
    "GRIZZLY STEPPE": {
        "type": "threat actor",
        "description": "Russian malicious cyber activity",
        "years": "2015-2018",
        "sources": [
            "https://www.us-cert.gov/GRIZZLY-STEPPE-Russian-Malicious-Cyber-Activity",
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2017/2017.02.10.Enhanced_Analysis_of_GRIZZLY_STEPPE/AR-17-20045_Enhanced_Analysis_of_GRIZZLY_STEPPE_Activity.pdf"
        ]
    },
    "Operation Potato": {
        "type": "threat actor",
        "description": "Among the victims that we were able to identify, the most notable high-value targets include Ukrainian government and military entities and one of the major Ukrainian news agencies. The malware was also used to spy on members of MMM, a financial pyramid scheme popular in Russia and Ukraine.",
        "years": "2011-2015",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2015/2015.07.30.Operation-Potao-Express/Operation-Potao-Express_final_v2.pdf"
        ]
    },
    "PlugX": {
        "type": "malware",
        "description": "PlugX was by far the most used malware variant for targeted activity during 2014. It proliferated greatly amongst China-based targeted intrusion adversaries and now appears to be the tool of choice for many. The malware has been around for years and has been used by multiple Chinese actors for quite some time; however, the frequency of PlugX use during 2014 revealed just how prominent it is.",
        "years": "2014",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2015/2015.02.10.CrowdStrike_GlobalThreatIntelReport_2014/GlobalThreatIntelReport.pdf"
        ]
    },
    "Charming Kitten": {
        "type": "threat actor",
        "description": "Iran-based adversary that leverages fake personas on social networking sites in order to conduct social engineering and ultimately targeted attacks against desired targets.",
        "years": "2014",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2015/2015.02.10.CrowdStrike_GlobalThreatIntelReport_2014/GlobalThreatIntelReport.pdf"
        ]
    },
    "HURRICANE PANDA": {
        "type": "threat actor",
        "description": "HURRICANE PANDA is an advanced China-based adversary actively targeting Internet services, engineering, and aerospace companies.",
        "years": "2014",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2015/2015.02.10.CrowdStrike_GlobalThreatIntelReport_2014/GlobalThreatIntelReport.pdf"
        ]
    },
    "Dukes": {
        "type": "ThreatActor",
        "description": "the Dukes, a well-resourced, highly dedicated and organized cyberespionage group that we believe has been working for the Russian Federation since at least 2008 to collect intelligence in support of foreign and security policy decision-making.",
        "years": "2008-2015",
        "sources": [
            "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/blob/master/2015/2015.09.17.duke_russian/dukes_whitepaper.pdf"
        ]
    },
    "template": {
        "type": "< threat actor/malware >",
        "description": "< Description of threat actor or malware >",
        "years": "< Known years active >",
        "sources": [
            "<Sources>"
        ]
    }
}
]